cfd/openfoam/compressible/rhoSimpleFoam/01_Laminar/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// ************************************************************************** //

numberOfSubdomains 4;

method simple;

simpleCoeffs
{
    n           ( 2 2 1 );  // nx ny nz
    delta       0.001;
}

// ************************************************************************* //
